/* მოგესალმებით მეგობრებო ეს არის დავალება ნომერი 2. დავალების ყველა ეტაპი აღწერილია კომენტარის სახით
 * 1) შედარება
 * 3) If პირობები
 * 4) ლოგიკური ოპერატორები
 * 5) Switch 
 */



// <------- შედარება ---------#### //

const num1 = 0;
const boolean1 = false;
const num2 = 5;
const emptyString = "";
const boolean2 = false;
const text = "I'm Text";
const text2 = "0";

// ჩამოწერეთ ცვლადები რომელი არის true რომელი false
// ჩამოწერეთ ზეპირად!
// მაგ. [1, 2, 3, 4]

// >>> კოდი დაწერეთ აქ 

const isFalse = [boolean1, boolean2];
const isTrue = [num2, num1, emptyString, text, text2];

//


// შეცვალეთ ერთი ასო რომ მიიღოთ ჭეშმარიტი დებულება
// მოკლედ ახსენით მუშაობის პრინციპი თუ რატომ იმოქმედა

console.log("ahc" > "ah") 
//ამის პრონციპი ცოტა ვერ გავიგე ,მაგრამ სულ იყო false სანამ b არ შევცვალე h 
console.log(2 === "004")   //თუ შევცვლით ორით console.log(2 === parseInt("002")) გავაკეთებთ ასე ამ დროს შეიცვლება
//პასუხი თუ არადა არ იმუშავებს და იქნება false  მგონი
console.log(2 === parseInt("002")) //ასეთ დროს არის true




// <------- ლოგიკური ოპერატორები ---------#### //

// შეამოწმეთ სრულ წლოვნებაზე და თუ მეტი ან ტოლია
// 18 წელზე შესთავაზეთ სასმელი

// >>> კოდი დაწერეთ აქ 
let asaki = 18;
let asaki_1 = Number(prompt(`შენი ასაკი`))
if (asaki == asaki_1) {
  console.log(`დავლიოთ?`)
} else if (asaki_1 > asaki) {
  console.log(`ასევე შეგვიძლია შემოგთვააზოთ ვისკი`)
}
else {
  console.log(`არა შენთვის არ შეიძლება`)
}

//


// მოიფიქრეთ 2 if else-ის მაგალითი თქვენით
const xelfasi = 300

if (xelfasi < 200) {
  console.log(`საშუალოზე დაბალი შემოსავალი`);
}
else if (xelfasi >= 200 && xelfasi < 300) {
  console.log(`საშუალოზე ოდნავ დაბალი შემოსავალი`);
}
else if (xelfasi >= 300 && xelfasi < 400) {
  console.log(`საშუალო შემოსავალი`);
}
else {
  console.log(`საშუალოზე მაღალი შემოსავალი`);
}
// >>> კოდი დაწერეთ აქ
let weli = 18;
if (weli >= 18) {
  //>= მეტია ან უდრის
  console.log('დაშვებლი ხარ პროგრამაში');
} else {
  console.log('ჯერ გახდი სრულწლოვანი ძმა');
}
//


// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ
weli >= 18 ? console.log('დაშვებლი ხარ პროგრამაში') : console.log('ჯერ გახდი სრულწლოვანი ძმა');
//
// გამიჭირდასავით გადაყვანა თ რავი შემაშინა ერთმა ხაზმა :დ


/*
  ჩვენ გვაქვს ოთხი ფერი რომელთაც აქვთ
  კონკრეტული ციფრები მინიჭებული (თეთრი=4, 
  წითელი=3, მწვანე=2, ლურჯი=1, შავი=0, 
  სხვა ყველა ფერი=undefinde)
*/

let colorId = 3

// დაწერეთ if ისე, რომ როდესაც ჩვენ
// შევცვლით მაღლა განსაზღვრულ ცვლადს გავიგოთ
// ამ აიდის ფერი (ფერი გამოიტანეთ კონსოლში ტექსტის
// სახით)


// >>> კოდი დაწერეთ აქ

if (colorId == 3) {
  console.log(`წითელი`);
}
else if (colorId == 2) {
  console.log(`მწვანე`)
}
else if (colorId == 4) {
  console.log(`თეთრი`)
}
else if (colorId == 0) {
  console.log(`შავი`)
}
else if (colorId == 1) {
  console.log(`თეთრი`)
}
else {
  console.log(`undefined`)
}
//



// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ
colorId = 3 ? console.log(`წითელი`) : colorId == 2 ? console.log(`მწვანე`) : colorId == 4 ? console.log(`თეთრი`) : colorId == 0 ? console.log(`შავი`) : console.log(`undefined`);


//


// <------- დავალება Switch ---------#### //

// ცადეთ იგივე გააკეთოთ რაც წინა დავალებაში
// ოღონდ ამჯერად Switch-ის დახმარებით


// >>> კოდი დაწერეთ აქ
switch (colorId) {
  case colorId == 3:
    console.log(`წითელი`)
  case colorId == 2:
    console.log(`მწვანე`)
  case colorId == 4:
    console.log(`ლურჯი`)
  case colorId == 0:
    console.log('შავი')
  case colorId == 1:
    console.log('თეთრი')
  default:
    console.log(`undefined`)
}

// მგონი ვურევ 



//  ||
//  ||
//  ||
// \  /
//  \/

/*
    ეს დავალება რომ ნახოთ გამოიყენეთ HTML,
    ჩვენი მიზანია ავაწყოთ ჩეთ ბოტი რომელთანაც ვისაუბრებთ
    როგორც ხედავთ დაბლა გამზადებული მაქვს კოდის გარკვეული
    ნაწილი ეს არის ფუნქცია რომელსაც მომავალში გავივლით
    კონკრეტულად ეს ფუნქცია არის რეკურსიული, რეკურსია
    არის პროცესი როდესაც ფუნქცია თავის თავს იძახებს ჩვენ კი
    იმიტომ ვიყენებთ ამას, რომ ყოველ ჯერზე როდესად რაღაცის თქმა
    დაგვჭირდება მზად იყოს სასაუბროდ ჩვენი ბოტი

    // კოდში მოათავსეთ Switch რომლითაც დააპროგნოზებთ სასაუბრო
    // სიტყვებს ააწყობთ მინი ჩათ ბოტს.
    მაგ. 
    """"
      case "გამარჯობა":
        alert("გამარჯობა");
        break;
    """"
*/
const bot = document.getElementById("bot")
bot.addEventListener("click", myFun())

function myFun() {
  let x = prompt("მე მზად არ ვარ პასუხისათვის")

  // >>> კოდი დაწერეთ აქ გამოიყენეთ Switch
  switch (x) {
    case `გამარჯობა`:
      alert(`გომორჯგუა`);
      break;
    case `მეგრულად როგორ არის როგორ ხარ?`:
      alert(`მუჭო რექ`);
      break;
    case `რას შვრები?`:
      alert(`მუს ორთუქ`);
      break;
    case `მადლობა დახმარებითვის`:
      alert(`არაფერს`);
      break; 
      
  }

  // რეკურსიული ფუნქცია
  myFun();
}